{
    "value":  [
                  "{\r\n    \"@odata.type\":  \"#microsoft.graph.windows10GeneralConfiguration\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"supportsScopeTags\":  false,\r\n    \"deviceManagementApplicabilityRuleOsEdition\":  null,\r\n    \"deviceManagementApplicabilityRuleOsVersion\":  null,\r\n    \"deviceManagementApplicabilityRuleDeviceMode\":  null,\r\n    \"description\":  null,\r\n    \"displayName\":  \"YSP_V1_Windows_Personal_Startmenu_Layout\",\r\n    \"taskManagerBlockEndTask\":  false,\r\n    \"energySaverOnBatteryThresholdPercentage\":  null,\r\n    \"energySaverPluggedInThresholdPercentage\":  null,\r\n    \"powerLidCloseActionOnBattery\":  \"notConfigured\",\r\n    \"powerLidCloseActionPluggedIn\":  \"notConfigured\",\r\n    \"powerButtonActionOnBattery\":  \"notConfigured\",\r\n    \"powerButtonActionPluggedIn\":  \"notConfigured\",\r\n    \"powerSleepButtonActionOnBattery\":  \"notConfigured\",\r\n    \"powerSleepButtonActionPluggedIn\":  \"notConfigured\",\r\n    \"powerHybridSleepOnBattery\":  \"notConfigured\",\r\n    \"powerHybridSleepPluggedIn\":  \"notConfigured\",\r\n    \"windows10AppsForceUpdateSchedule\":  null,\r\n    \"enableAutomaticRedeployment\":  false,\r\n    \"microsoftAccountSignInAssistantSettings\":  \"notConfigured\",\r\n    \"authenticationAllowSecondaryDevice\":  false,\r\n    \"authenticationWebSignIn\":  \"notConfigured\",\r\n    \"authenticationPreferredAzureADTenantDomainName\":  null,\r\n    \"cryptographyAllowFipsAlgorithmPolicy\":  false,\r\n    \"displayAppListWithGdiDPIScalingTurnedOn\":  [\r\n\r\n                                                ],\r\n    \"displayAppListWithGdiDPIScalingTurnedOff\":  [\r\n\r\n                                                 ],\r\n    \"enterpriseCloudPrintDiscoveryEndPoint\":  null,\r\n    \"enterpriseCloudPrintOAuthAuthority\":  null,\r\n    \"enterpriseCloudPrintOAuthClientIdentifier\":  null,\r\n    \"enterpriseCloudPrintResourceIdentifier\":  null,\r\n    \"enterpriseCloudPrintDiscoveryMaxLimit\":  null,\r\n    \"enterpriseCloudPrintMopriaDiscoveryResourceIdentifier\":  null,\r\n    \"experienceDoNotSyncBrowserSettings\":  \"notConfigured\",\r\n    \"messagingBlockSync\":  false,\r\n    \"messagingBlockMMS\":  false,\r\n    \"messagingBlockRichCommunicationServices\":  false,\r\n    \"printerNames\":  [\r\n\r\n                     ],\r\n    \"printerDefaultName\":  null,\r\n    \"printerBlockAddition\":  false,\r\n    \"searchBlockDiacritics\":  false,\r\n    \"searchDisableAutoLanguageDetection\":  false,\r\n    \"searchDisableIndexingEncryptedItems\":  false,\r\n    \"searchEnableRemoteQueries\":  false,\r\n    \"searchDisableUseLocation\":  false,\r\n    \"searchDisableLocation\":  false,\r\n    \"searchDisableIndexerBackoff\":  false,\r\n    \"searchDisableIndexingRemovableDrive\":  false,\r\n    \"searchEnableAutomaticIndexSizeManangement\":  false,\r\n    \"searchBlockWebResults\":  false,\r\n    \"findMyFiles\":  \"notConfigured\",\r\n    \"securityBlockAzureADJoinedDevicesAutoEncryption\":  false,\r\n    \"diagnosticsDataSubmissionMode\":  \"userDefined\",\r\n    \"oneDriveDisableFileSync\":  false,\r\n    \"systemTelemetryProxyServer\":  null,\r\n    \"edgeTelemetryForMicrosoft365Analytics\":  \"notConfigured\",\r\n    \"inkWorkspaceAccess\":  \"notConfigured\",\r\n    \"inkWorkspaceAccessState\":  \"notConfigured\",\r\n    \"inkWorkspaceBlockSuggestedApps\":  false,\r\n    \"smartScreenEnableAppInstallControl\":  false,\r\n    \"smartScreenAppInstallControl\":  \"notConfigured\",\r\n    \"personalizationDesktopImageUrl\":  null,\r\n    \"personalizationLockScreenImageUrl\":  null,\r\n    \"bluetoothAllowedServices\":  [\r\n\r\n                                 ],\r\n    \"bluetoothBlockAdvertising\":  false,\r\n    \"bluetoothBlockPromptedProximalConnections\":  false,\r\n    \"bluetoothBlockDiscoverableMode\":  false,\r\n    \"bluetoothBlockPrePairing\":  false,\r\n    \"edgeBlockAutofill\":  false,\r\n    \"edgeBlocked\":  false,\r\n    \"edgeCookiePolicy\":  \"userDefined\",\r\n    \"edgeBlockDeveloperTools\":  false,\r\n    \"edgeBlockSendingDoNotTrackHeader\":  false,\r\n    \"edgeBlockExtensions\":  false,\r\n    \"edgeBlockInPrivateBrowsing\":  false,\r\n    \"edgeBlockJavaScript\":  false,\r\n    \"edgeBlockPasswordManager\":  false,\r\n    \"edgeBlockAddressBarDropdown\":  false,\r\n    \"edgeBlockCompatibilityList\":  false,\r\n    \"edgeClearBrowsingDataOnExit\":  false,\r\n    \"edgeAllowStartPagesModification\":  false,\r\n    \"edgeDisableFirstRunPage\":  false,\r\n    \"edgeBlockLiveTileDataCollection\":  false,\r\n    \"edgeSyncFavoritesWithInternetExplorer\":  false,\r\n    \"edgeFavoritesListLocation\":  null,\r\n    \"edgeBlockEditFavorites\":  false,\r\n    \"edgeNewTabPageURL\":  null,\r\n    \"edgeHomeButtonConfiguration\":  null,\r\n    \"edgeHomeButtonConfigurationEnabled\":  false,\r\n    \"edgeOpensWith\":  \"notConfigured\",\r\n    \"edgeBlockSideloadingExtensions\":  false,\r\n    \"edgeRequiredExtensionPackageFamilyNames\":  [\r\n\r\n                                                ],\r\n    \"edgeBlockPrinting\":  false,\r\n    \"edgeFavoritesBarVisibility\":  \"notConfigured\",\r\n    \"edgeBlockSavingHistory\":  false,\r\n    \"edgeBlockFullScreenMode\":  false,\r\n    \"edgeBlockWebContentOnNewTabPage\":  false,\r\n    \"edgeBlockTabPreloading\":  false,\r\n    \"edgeBlockPrelaunch\":  false,\r\n    \"edgeShowMessageWhenOpeningInternetExplorerSites\":  \"notConfigured\",\r\n    \"edgePreventCertificateErrorOverride\":  false,\r\n    \"edgeKioskModeRestriction\":  \"notConfigured\",\r\n    \"edgeKioskResetAfterIdleTimeInMinutes\":  null,\r\n    \"cellularBlockDataWhenRoaming\":  false,\r\n    \"cellularBlockVpn\":  false,\r\n    \"cellularBlockVpnWhenRoaming\":  false,\r\n    \"cellularData\":  \"allowed\",\r\n    \"defenderRequireRealTimeMonitoring\":  false,\r\n    \"defenderRequireBehaviorMonitoring\":  false,\r\n    \"defenderRequireNetworkInspectionSystem\":  false,\r\n    \"defenderScanDownloads\":  false,\r\n    \"defenderScheduleScanEnableLowCpuPriority\":  false,\r\n    \"defenderDisableCatchupQuickScan\":  false,\r\n    \"defenderDisableCatchupFullScan\":  false,\r\n    \"defenderScanScriptsLoadedInInternetExplorer\":  false,\r\n    \"defenderBlockEndUserAccess\":  false,\r\n    \"defenderSignatureUpdateIntervalInHours\":  null,\r\n    \"defenderMonitorFileActivity\":  \"userDefined\",\r\n    \"defenderDaysBeforeDeletingQuarantinedMalware\":  null,\r\n    \"defenderScanMaxCpu\":  null,\r\n    \"defenderScanArchiveFiles\":  false,\r\n    \"defenderScanIncomingMail\":  false,\r\n    \"defenderScanRemovableDrivesDuringFullScan\":  false,\r\n    \"defenderScanMappedNetworkDrivesDuringFullScan\":  false,\r\n    \"defenderScanNetworkFiles\":  false,\r\n    \"defenderRequireCloudProtection\":  false,\r\n    \"defenderCloudBlockLevel\":  \"notConfigured\",\r\n    \"defenderCloudExtendedTimeout\":  null,\r\n    \"defenderCloudExtendedTimeoutInSeconds\":  null,\r\n    \"defenderPromptForSampleSubmission\":  \"userDefined\",\r\n    \"defenderScheduledQuickScanTime\":  null,\r\n    \"defenderScanType\":  \"userDefined\",\r\n    \"defenderSystemScanSchedule\":  \"userDefined\",\r\n    \"defenderScheduledScanTime\":  null,\r\n    \"defenderPotentiallyUnwantedAppAction\":  null,\r\n    \"defenderPotentiallyUnwantedAppActionSetting\":  \"userDefined\",\r\n    \"defenderSubmitSamplesConsentType\":  null,\r\n    \"defenderBlockOnAccessProtection\":  false,\r\n    \"defenderDetectedMalwareActions\":  null,\r\n    \"defenderFileExtensionsToExclude\":  [\r\n\r\n                                        ],\r\n    \"defenderFilesAndFoldersToExclude\":  [\r\n\r\n                                         ],\r\n    \"defenderProcessesToExclude\":  [\r\n\r\n                                   ],\r\n    \"lockScreenAllowTimeoutConfiguration\":  false,\r\n    \"lockScreenBlockActionCenterNotifications\":  false,\r\n    \"lockScreenBlockCortana\":  false,\r\n    \"lockScreenBlockToastNotifications\":  false,\r\n    \"lockScreenTimeoutInSeconds\":  null,\r\n    \"lockScreenActivateAppsWithVoice\":  \"notConfigured\",\r\n    \"passwordBlockSimple\":  false,\r\n    \"passwordExpirationDays\":  null,\r\n    \"passwordMinimumLength\":  null,\r\n    \"passwordMinutesOfInactivityBeforeScreenTimeout\":  null,\r\n    \"passwordMinimumCharacterSetCount\":  null,\r\n    \"passwordPreviousPasswordBlockCount\":  null,\r\n    \"passwordRequired\":  false,\r\n    \"passwordRequireWhenResumeFromIdleState\":  false,\r\n    \"passwordRequiredType\":  \"deviceDefault\",\r\n    \"passwordSignInFailureCountBeforeFactoryReset\":  null,\r\n    \"passwordMinimumAgeInDays\":  null,\r\n    \"privacyAdvertisingId\":  \"notConfigured\",\r\n    \"privacyAutoAcceptPairingAndConsentPrompts\":  false,\r\n    \"privacyDisableLaunchExperience\":  false,\r\n    \"privacyBlockInputPersonalization\":  false,\r\n    \"privacyBlockPublishUserActivities\":  false,\r\n    \"privacyBlockActivityFeed\":  false,\r\n    \"activateAppsWithVoice\":  \"notConfigured\",\r\n    \"startBlockUnpinningAppsFromTaskbar\":  false,\r\n    \"startMenuAppListVisibility\":  \"userDefined\",\r\n    \"startMenuHideChangeAccountSettings\":  false,\r\n    \"startMenuHideFrequentlyUsedApps\":  false,\r\n    \"startMenuHideHibernate\":  false,\r\n    \"startMenuHideLock\":  false,\r\n    \"startMenuHidePowerButton\":  false,\r\n    \"startMenuHideRecentJumpLists\":  false,\r\n    \"startMenuHideRecentlyAddedApps\":  false,\r\n    \"startMenuHideRestartOptions\":  false,\r\n    \"startMenuHideShutDown\":  false,\r\n    \"startMenuHideSignOut\":  false,\r\n    \"startMenuHideSleep\":  false,\r\n    \"startMenuHideSwitchAccount\":  false,\r\n    \"startMenuHideUserTile\":  false,\r\n    \"startMenuLayoutEdgeAssetsXml\":  null,\r\n    \"startMenuLayoutXml\":  \"PExheW91dE1vZGlmaWNhdGlvblRlbXBsYXRlIHhtbG5zOmRlZmF1bHRsYXlvdXQ9Imh0dHA6Ly9zY2hlbWFzLm1pY3Jvc29mdC5jb20vU3RhcnQvMjAxNC9GdWxsRGVmYXVsdExheW91dCIgeG1sbnM6c3RhcnQ9Imh0dHA6Ly9zY2hlbWFzLm1pY3Jvc29mdC5jb20vU3RhcnQvMjAxNC9TdGFydExheW91dCIgeG1sbnM6dGFza2Jhcj0iaHR0cDovL3NjaGVtYXMubWljcm9zb2Z0LmNvbS9TdGFydC8yMDE0L1Rhc2tiYXJMYXlvdXQiIHhtbG5zPSJodHRwOi8vc2NoZW1hcy5taWNyb3NvZnQuY29tL1N0YXJ0LzIwMTQvTGF5b3V0TW9kaWZpY2F0aW9uIiBWZXJzaW9uPSIxIj4NCiAgPExheW91dE9wdGlvbnMgU3RhcnRUaWxlR3JvdXBDZWxsV2lkdGg9IjYiIC8+DQogICA8RGVmYXVsdExheW91dE92ZXJyaWRlIExheW91dEN1c3RvbWl6YXRpb25SZXN0cmljdGlvblR5cGU9Ik9ubHlTcGVjaWZpZWRHcm91cHMiPg0KICAgICAgIDxTdGFydExheW91dENvbGxlY3Rpb24+DQogICAgICAgICA8ZGVmYXVsdGxheW91dDpTdGFydExheW91dCBHcm91cENlbGxXaWR0aD0iNiI+DQogICAgICAgICAgIDxzdGFydDpHcm91cCBOYW1lPSJPZmZpY2UiPg0KICAgICAgICAgICAgIDxzdGFydDpEZXNrdG9wQXBwbGljYXRpb25UaWxlIFNpemU9IjJ4MiIgQ29sdW1uPSI0IiBSb3c9IjIiIERlc2t0b3BBcHBsaWNhdGlvbklEPSJNaWNyb3NvZnQuT2ZmaWNlLk9ORU5PVEUuRVhFLjE1IiAvPg0KICAgICAgICAgICAgIDxzdGFydDpEZXNrdG9wQXBwbGljYXRpb25UaWxlIFNpemU9IjJ4MiIgQ29sdW1uPSIwIiBSb3c9IjIiIERlc2t0b3BBcHBsaWNhdGlvbklEPSJjb20uc3F1aXJyZWwuVGVhbXMuVGVhbXMiIC8+DQogICAgICAgICAgICAgPHN0YXJ0OkRlc2t0b3BBcHBsaWNhdGlvblRpbGUgU2l6ZT0iMngyIiBDb2x1bW49IjIiIFJvdz0iMiIgRGVza3RvcEFwcGxpY2F0aW9uSUQ9Ik1pY3Jvc29mdC5PZmZpY2UuUE9XRVJQTlQuRVhFLjE1IiAvPg0KICAgICAgICAgICAgIDxzdGFydDpEZXNrdG9wQXBwbGljYXRpb25UaWxlIFNpemU9IjJ4MiIgQ29sdW1uPSIyIiBSb3c9IjAiIERlc2t0b3BBcHBsaWNhdGlvbklEPSJNaWNyb3NvZnQuT2ZmaWNlLldJTldPUkQuRVhFLjE1IiAvPg0KICAgICAgICAgICAgIDxzdGFydDpEZXNrdG9wQXBwbGljYXRpb25UaWxlIFNpemU9IjJ4MiIgQ29sdW1uPSIwIiBSb3c9IjAiIERlc2t0b3BBcHBsaWNhdGlvbklEPSJNaWNyb3NvZnQuT2ZmaWNlLk9VVExPT0suRVhFLjE1IiAvPg0KICAgICAgICAgICAgIDxzdGFydDpEZXNrdG9wQXBwbGljYXRpb25UaWxlIFNpemU9IjJ4MiIgQ29sdW1uPSI0IiBSb3c9IjAiIERlc2t0b3BBcHBsaWNhdGlvbklEPSJNaWNyb3NvZnQuT2ZmaWNlLkVYQ0VMLkVYRS4xNSIgLz4NCiAgICAgICAgICAgPC9zdGFydDpHcm91cD4NCiAgICAgICAgICAgPHN0YXJ0Okdyb3VwIE5hbWU9IlByb2R1Y3Rpdml0eSI+DQogICAgICAgICAgICAgPHN0YXJ0OkRlc2t0b3BBcHBsaWNhdGlvblRpbGUgU2l6ZT0iMngyIiBDb2x1bW49IjAiIFJvdz0iMCIgRGVza3RvcEFwcGxpY2F0aW9uSUQ9Ik1TRWRnZSIgLz4NCiAgICAgICAgICAgPC9zdGFydDpHcm91cD4NCiAgICAgICAgICAgPHN0YXJ0Okdyb3VwIE5hbWU9IkV4cGxvcmUiPg0KICAgICAgICAgICAgIDxzdGFydDpUaWxlIFNpemU9IjJ4MiIgQ29sdW1uPSIwIiBSb3c9IjAiIEFwcFVzZXJNb2RlbElEPSJNaWNyb3NvZnQuV2luZG93c1N0b3JlXzh3ZWt5YjNkOGJid2UhQXBwIiAvPg0KICAgICAgICAgICA8L3N0YXJ0Okdyb3VwPg0KICAgICAgICAgPC9kZWZhdWx0bGF5b3V0OlN0YXJ0TGF5b3V0Pg0KICAgICAgIDwvU3RhcnRMYXlvdXRDb2xsZWN0aW9uPg0KCTwvRGVmYXVsdExheW91dE92ZXJyaWRlPg0KPEN1c3RvbVRhc2tiYXJMYXlvdXRDb2xsZWN0aW9uIFBpbkxpc3RQbGFjZW1lbnQ9IlJlcGxhY2UiPg0KICA8ZGVmYXVsdGxheW91dDpUYXNrYmFyTGF5b3V0Pg0KICAgIDx0YXNrYmFyOlRhc2tiYXJQaW5MaXN0Pg0KCSAgPHRhc2tiYXI6RGVza3RvcEFwcCBEZXNrdG9wQXBwbGljYXRpb25MaW5rUGF0aD0iJUFQUERBVEElXE1pY3Jvc29mdFxXaW5kb3dzXFN0YXJ0IE1lbnVcUHJvZ3JhbXNcU3lzdGVtIFRvb2xzXEZpbGUgRXhwbG9yZXIubG5rIi8+DQoJICA8dGFza2JhcjpVV0EgQXBwVXNlck1vZGVsSUQ9Ik1pY3Jvc29mdC5NaWNyb3NvZnRFZGdlXzh3ZWt5YjNkOGJid2UhTWljcm9zb2Z0RWRnZSIvPg0KCSAgPHRhc2tiYXI6RGVza3RvcEFwcCBEZXNrdG9wQXBwbGljYXRpb25MaW5rUGF0aD0iJUFMTFVTRVJTUFJPRklMRSVcTWljcm9zb2Z0XFdpbmRvd3NcU3RhcnQgTWVudVxQcm9ncmFtc1xPdXRsb29rLmxuayIvPg0KCSAgPHRhc2tiYXI6RGVza3RvcEFwcCBEZXNrdG9wQXBwbGljYXRpb25MaW5rUGF0aD0iJUFMTFVTRVJTUFJPRklMRSVcTWljcm9zb2Z0XFdpbmRvd3NcU3RhcnQgTWVudVxQcm9ncmFtc1xXb3JkLmxuayIvPg0KCSAgPHRhc2tiYXI6RGVza3RvcEFwcCBEZXNrdG9wQXBwbGljYXRpb25MaW5rUGF0aD0iJUFMTFVTRVJTUFJPRklMRSVcTWljcm9zb2Z0XFdpbmRvd3NcU3RhcnQgTWVudVxQcm9ncmFtc1xFeGNlbC5sbmsiLz4NCiAgICA8L3Rhc2tiYXI6VGFza2JhclBpbkxpc3Q+DQogIDwvZGVmYXVsdGxheW91dDpUYXNrYmFyTGF5b3V0Pg0KPC9DdXN0b21UYXNrYmFyTGF5b3V0Q29sbGVjdGlvbj4NCjwvTGF5b3V0TW9kaWZpY2F0aW9uVGVtcGxhdGU+\",\r\n    \"startMenuMode\":  \"userDefined\",\r\n    \"startMenuPinnedFolderDocuments\":  \"notConfigured\",\r\n    \"startMenuPinnedFolderDownloads\":  \"notConfigured\",\r\n    \"startMenuPinnedFolderFileExplorer\":  \"notConfigured\",\r\n    \"startMenuPinnedFolderHomeGroup\":  \"notConfigured\",\r\n    \"startMenuPinnedFolderMusic\":  \"notConfigured\",\r\n    \"startMenuPinnedFolderNetwork\":  \"notConfigured\",\r\n    \"startMenuPinnedFolderPersonalFolder\":  \"notConfigured\",\r\n    \"startMenuPinnedFolderPictures\":  \"notConfigured\",\r\n    \"startMenuPinnedFolderSettings\":  \"notConfigured\",\r\n    \"startMenuPinnedFolderVideos\":  \"notConfigured\",\r\n    \"settingsBlockSettingsApp\":  false,\r\n    \"settingsBlockSystemPage\":  false,\r\n    \"settingsBlockDevicesPage\":  false,\r\n    \"settingsBlockNetworkInternetPage\":  false,\r\n    \"settingsBlockPersonalizationPage\":  false,\r\n    \"settingsBlockAccountsPage\":  false,\r\n    \"settingsBlockTimeLanguagePage\":  false,\r\n    \"settingsBlockEaseOfAccessPage\":  false,\r\n    \"settingsBlockPrivacyPage\":  false,\r\n    \"settingsBlockUpdateSecurityPage\":  false,\r\n    \"settingsBlockAppsPage\":  false,\r\n    \"settingsBlockGamingPage\":  false,\r\n    \"windowsSpotlightBlockConsumerSpecificFeatures\":  false,\r\n    \"windowsSpotlightBlocked\":  false,\r\n    \"windowsSpotlightBlockOnActionCenter\":  false,\r\n    \"windowsSpotlightBlockTailoredExperiences\":  false,\r\n    \"windowsSpotlightBlockThirdPartyNotifications\":  false,\r\n    \"windowsSpotlightBlockWelcomeExperience\":  false,\r\n    \"windowsSpotlightBlockWindowsTips\":  false,\r\n    \"windowsSpotlightConfigureOnLockScreen\":  \"notConfigured\",\r\n    \"networkProxyApplySettingsDeviceWide\":  false,\r\n    \"networkProxyDisableAutoDetect\":  false,\r\n    \"networkProxyAutomaticConfigurationUrl\":  null,\r\n    \"networkProxyServer\":  null,\r\n    \"accountsBlockAddingNonMicrosoftAccountEmail\":  false,\r\n    \"antiTheftModeBlocked\":  false,\r\n    \"bluetoothBlocked\":  false,\r\n    \"cameraBlocked\":  false,\r\n    \"connectedDevicesServiceBlocked\":  false,\r\n    \"certificatesBlockManualRootCertificateInstallation\":  false,\r\n    \"copyPasteBlocked\":  false,\r\n    \"cortanaBlocked\":  false,\r\n    \"deviceManagementBlockFactoryResetOnMobile\":  false,\r\n    \"deviceManagementBlockManualUnenroll\":  false,\r\n    \"safeSearchFilter\":  \"userDefined\",\r\n    \"edgeBlockPopups\":  false,\r\n    \"edgeBlockSearchSuggestions\":  false,\r\n    \"edgeBlockSearchEngineCustomization\":  false,\r\n    \"edgeBlockSendingIntranetTrafficToInternetExplorer\":  false,\r\n    \"edgeSendIntranetTrafficToInternetExplorer\":  false,\r\n    \"edgeRequireSmartScreen\":  false,\r\n    \"edgeEnterpriseModeSiteListLocation\":  null,\r\n    \"edgeFirstRunUrl\":  null,\r\n    \"edgeSearchEngine\":  null,\r\n    \"edgeHomepageUrls\":  [\r\n\r\n                         ],\r\n    \"edgeBlockAccessToAboutFlags\":  false,\r\n    \"smartScreenBlockPromptOverride\":  false,\r\n    \"smartScreenBlockPromptOverrideForFiles\":  false,\r\n    \"webRtcBlockLocalhostIpAddress\":  false,\r\n    \"internetSharingBlocked\":  false,\r\n    \"settingsBlockAddProvisioningPackage\":  false,\r\n    \"settingsBlockRemoveProvisioningPackage\":  false,\r\n    \"settingsBlockChangeSystemTime\":  false,\r\n    \"settingsBlockEditDeviceName\":  false,\r\n    \"settingsBlockChangeRegion\":  false,\r\n    \"settingsBlockChangeLanguage\":  false,\r\n    \"settingsBlockChangePowerSleep\":  false,\r\n    \"locationServicesBlocked\":  false,\r\n    \"microsoftAccountBlocked\":  false,\r\n    \"microsoftAccountBlockSettingsSync\":  false,\r\n    \"nfcBlocked\":  false,\r\n    \"resetProtectionModeBlocked\":  false,\r\n    \"screenCaptureBlocked\":  false,\r\n    \"storageBlockRemovableStorage\":  false,\r\n    \"storageRequireMobileDeviceEncryption\":  false,\r\n    \"usbBlocked\":  false,\r\n    \"voiceRecordingBlocked\":  false,\r\n    \"wiFiBlockAutomaticConnectHotspots\":  false,\r\n    \"wiFiBlocked\":  false,\r\n    \"wiFiBlockManualConfiguration\":  false,\r\n    \"wiFiScanInterval\":  null,\r\n    \"wirelessDisplayBlockProjectionToThisDevice\":  false,\r\n    \"wirelessDisplayBlockUserInputFromReceiver\":  false,\r\n    \"wirelessDisplayRequirePinForPairing\":  false,\r\n    \"windowsStoreBlocked\":  false,\r\n    \"appsAllowTrustedAppsSideloading\":  \"notConfigured\",\r\n    \"windowsStoreBlockAutoUpdate\":  false,\r\n    \"developerUnlockSetting\":  \"notConfigured\",\r\n    \"sharedUserAppDataAllowed\":  false,\r\n    \"appsBlockWindowsStoreOriginatedApps\":  false,\r\n    \"windowsStoreEnablePrivateStoreOnly\":  false,\r\n    \"storageRestrictAppDataToSystemVolume\":  false,\r\n    \"storageRestrictAppInstallToSystemVolume\":  false,\r\n    \"gameDvrBlocked\":  false,\r\n    \"experienceBlockDeviceDiscovery\":  false,\r\n    \"experienceBlockErrorDialogWhenNoSIM\":  false,\r\n    \"experienceBlockTaskSwitcher\":  false,\r\n    \"logonBlockFastUserSwitching\":  false,\r\n    \"tenantLockdownRequireNetworkDuringOutOfBoxExperience\":  false,\r\n    \"appManagementMSIAllowUserControlOverInstall\":  false,\r\n    \"appManagementMSIAlwaysInstallWithElevatedPrivileges\":  false,\r\n    \"dataProtectionBlockDirectMemoryAccess\":  null,\r\n    \"appManagementPackageFamilyNamesToLaunchAfterLogOn\":  [\r\n\r\n                                                          ],\r\n    \"uninstallBuiltInApps\":  false,\r\n    \"configureTimeZone\":  null\r\n}",
                  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations",
                  "YSP_V1_Windows_Personal_Startmenu_Layout",
                  [
                      "35888256-2d7d-451a-85f4-d56a5e30a2a9"
                  ],
                  {
                      "id":  "35888256-2d7d-451a-85f4-d56a5e30a2a9_0cecaccc-dd1b-4c41-9b67-aaa09a39719a",
                      "source":  "direct",
                      "sourceId":  "35888256-2d7d-451a-85f4-d56a5e30a2a9",
                      "intent":  "apply",
                      "target":  {
                                     "@odata.type":  "#microsoft.graph.groupAssignmentTarget",
                                     "deviceAndAppManagementAssignmentFilterId":  null,
                                     "deviceAndAppManagementAssignmentFilterType":  "none",
                                     "groupId":  "YSP_All_Autopilot_Devices_Personal"
                                 }
                  }
              ],
    "Count":  5
}