{
    "value":  [
                  "{\r\n    \"@odata.type\":  \"#microsoft.graph.windows10EndpointProtectionConfiguration\",\r\n    \"roleScopeTagIds\":  [\r\n                            \"0\"\r\n                        ],\r\n    \"supportsScopeTags\":  false,\r\n    \"deviceManagementApplicabilityRuleOsEdition\":  null,\r\n    \"deviceManagementApplicabilityRuleOsVersion\":  null,\r\n    \"deviceManagementApplicabilityRuleDeviceMode\":  null,\r\n    \"description\":  null,\r\n    \"displayName\":  \"YSP_V1_Windows_Allow_Miracast_Custom\",\r\n    \"dmaGuardDeviceEnumerationPolicy\":  \"deviceDefault\",\r\n    \"userRightsAccessCredentialManagerAsTrustedCaller\":  null,\r\n    \"userRightsAllowAccessFromNetwork\":  null,\r\n    \"userRightsBlockAccessFromNetwork\":  null,\r\n    \"userRightsActAsPartOfTheOperatingSystem\":  null,\r\n    \"userRightsLocalLogOn\":  null,\r\n    \"userRightsDenyLocalLogOn\":  null,\r\n    \"userRightsBackupData\":  null,\r\n    \"userRightsChangeSystemTime\":  null,\r\n    \"userRightsCreateGlobalObjects\":  null,\r\n    \"userRightsCreatePageFile\":  null,\r\n    \"userRightsCreatePermanentSharedObjects\":  null,\r\n    \"userRightsCreateSymbolicLinks\":  null,\r\n    \"userRightsCreateToken\":  null,\r\n    \"userRightsDebugPrograms\":  null,\r\n    \"userRightsRemoteDesktopServicesLogOn\":  null,\r\n    \"userRightsDelegation\":  null,\r\n    \"userRightsGenerateSecurityAudits\":  null,\r\n    \"userRightsImpersonateClient\":  null,\r\n    \"userRightsIncreaseSchedulingPriority\":  null,\r\n    \"userRightsLoadUnloadDrivers\":  null,\r\n    \"userRightsLockMemory\":  null,\r\n    \"userRightsManageAuditingAndSecurityLogs\":  null,\r\n    \"userRightsManageVolumes\":  null,\r\n    \"userRightsModifyFirmwareEnvironment\":  null,\r\n    \"userRightsModifyObjectLabels\":  null,\r\n    \"userRightsProfileSingleProcess\":  null,\r\n    \"userRightsRemoteShutdown\":  null,\r\n    \"userRightsRestoreData\":  null,\r\n    \"userRightsTakeOwnership\":  null,\r\n    \"xboxServicesEnableXboxGameSaveTask\":  false,\r\n    \"xboxServicesAccessoryManagementServiceStartupMode\":  \"manual\",\r\n    \"xboxServicesLiveAuthManagerServiceStartupMode\":  \"manual\",\r\n    \"xboxServicesLiveGameSaveServiceStartupMode\":  \"manual\",\r\n    \"xboxServicesLiveNetworkingServiceStartupMode\":  \"manual\",\r\n    \"localSecurityOptionsBlockMicrosoftAccounts\":  false,\r\n    \"localSecurityOptionsBlockRemoteLogonWithBlankPassword\":  false,\r\n    \"localSecurityOptionsDisableAdministratorAccount\":  false,\r\n    \"localSecurityOptionsAdministratorAccountName\":  null,\r\n    \"localSecurityOptionsDisableGuestAccount\":  false,\r\n    \"localSecurityOptionsGuestAccountName\":  null,\r\n    \"localSecurityOptionsAllowUndockWithoutHavingToLogon\":  false,\r\n    \"localSecurityOptionsBlockUsersInstallingPrinterDrivers\":  false,\r\n    \"localSecurityOptionsBlockRemoteOpticalDriveAccess\":  false,\r\n    \"localSecurityOptionsFormatAndEjectOfRemovableMediaAllowedUser\":  \"notConfigured\",\r\n    \"localSecurityOptionsMachineInactivityLimit\":  null,\r\n    \"localSecurityOptionsMachineInactivityLimitInMinutes\":  null,\r\n    \"localSecurityOptionsDoNotRequireCtrlAltDel\":  false,\r\n    \"localSecurityOptionsHideLastSignedInUser\":  false,\r\n    \"localSecurityOptionsHideUsernameAtSignIn\":  false,\r\n    \"localSecurityOptionsLogOnMessageTitle\":  null,\r\n    \"localSecurityOptionsLogOnMessageText\":  null,\r\n    \"localSecurityOptionsAllowPKU2UAuthenticationRequests\":  false,\r\n    \"localSecurityOptionsAllowRemoteCallsToSecurityAccountsManagerHelperBool\":  false,\r\n    \"localSecurityOptionsAllowRemoteCallsToSecurityAccountsManager\":  null,\r\n    \"localSecurityOptionsMinimumSessionSecurityForNtlmSspBasedClients\":  \"none\",\r\n    \"localSecurityOptionsMinimumSessionSecurityForNtlmSspBasedServers\":  \"none\",\r\n    \"lanManagerAuthenticationLevel\":  \"lmAndNltm\",\r\n    \"lanManagerWorkstationDisableInsecureGuestLogons\":  false,\r\n    \"localSecurityOptionsClearVirtualMemoryPageFile\":  false,\r\n    \"localSecurityOptionsAllowSystemToBeShutDownWithoutHavingToLogOn\":  false,\r\n    \"localSecurityOptionsAllowUIAccessApplicationElevation\":  false,\r\n    \"localSecurityOptionsVirtualizeFileAndRegistryWriteFailuresToPerUserLocations\":  false,\r\n    \"localSecurityOptionsOnlyElevateSignedExecutables\":  false,\r\n    \"localSecurityOptionsAdministratorElevationPromptBehavior\":  \"notConfigured\",\r\n    \"localSecurityOptionsStandardUserElevationPromptBehavior\":  \"notConfigured\",\r\n    \"localSecurityOptionsSwitchToSecureDesktopWhenPromptingForElevation\":  false,\r\n    \"localSecurityOptionsDetectApplicationInstallationsAndPromptForElevation\":  false,\r\n    \"localSecurityOptionsAllowUIAccessApplicationsForSecureLocations\":  false,\r\n    \"localSecurityOptionsUseAdminApprovalMode\":  false,\r\n    \"localSecurityOptionsUseAdminApprovalModeForAdministrators\":  false,\r\n    \"localSecurityOptionsInformationShownOnLockScreen\":  \"notConfigured\",\r\n    \"localSecurityOptionsInformationDisplayedOnLockScreen\":  \"notConfigured\",\r\n    \"localSecurityOptionsDisableClientDigitallySignCommunicationsIfServerAgrees\":  false,\r\n    \"localSecurityOptionsClientDigitallySignCommunicationsAlways\":  false,\r\n    \"localSecurityOptionsClientSendUnencryptedPasswordToThirdPartySMBServers\":  false,\r\n    \"localSecurityOptionsDisableServerDigitallySignCommunicationsAlways\":  false,\r\n    \"localSecurityOptionsDisableServerDigitallySignCommunicationsIfClientAgrees\":  false,\r\n    \"localSecurityOptionsRestrictAnonymousAccessToNamedPipesAndShares\":  false,\r\n    \"localSecurityOptionsDoNotAllowAnonymousEnumerationOfSAMAccounts\":  false,\r\n    \"localSecurityOptionsAllowAnonymousEnumerationOfSAMAccountsAndShares\":  false,\r\n    \"localSecurityOptionsDoNotStoreLANManagerHashValueOnNextPasswordChange\":  false,\r\n    \"localSecurityOptionsSmartCardRemovalBehavior\":  \"noAction\",\r\n    \"defenderSecurityCenterDisableAppBrowserUI\":  null,\r\n    \"defenderSecurityCenterDisableFamilyUI\":  null,\r\n    \"defenderSecurityCenterDisableHealthUI\":  null,\r\n    \"defenderSecurityCenterDisableNetworkUI\":  null,\r\n    \"defenderSecurityCenterDisableVirusUI\":  null,\r\n    \"defenderSecurityCenterDisableAccountUI\":  null,\r\n    \"defenderSecurityCenterDisableClearTpmUI\":  null,\r\n    \"defenderSecurityCenterDisableHardwareUI\":  null,\r\n    \"defenderSecurityCenterDisableNotificationAreaUI\":  null,\r\n    \"defenderSecurityCenterDisableRansomwareUI\":  null,\r\n    \"defenderSecurityCenterDisableSecureBootUI\":  null,\r\n    \"defenderSecurityCenterDisableTroubleshootingUI\":  null,\r\n    \"defenderSecurityCenterDisableVulnerableTpmFirmwareUpdateUI\":  null,\r\n    \"defenderSecurityCenterOrganizationDisplayName\":  null,\r\n    \"defenderSecurityCenterHelpEmail\":  null,\r\n    \"defenderSecurityCenterHelpPhone\":  null,\r\n    \"defenderSecurityCenterHelpURL\":  null,\r\n    \"defenderSecurityCenterNotificationsFromApp\":  \"notConfigured\",\r\n    \"defenderSecurityCenterITContactDisplay\":  \"notConfigured\",\r\n    \"windowsDefenderTamperProtection\":  \"notConfigured\",\r\n    \"firewallBlockStatefulFTP\":  null,\r\n    \"firewallIdleTimeoutForSecurityAssociationInSeconds\":  null,\r\n    \"firewallPreSharedKeyEncodingMethod\":  \"deviceDefault\",\r\n    \"firewallIPSecExemptionsNone\":  false,\r\n    \"firewallIPSecExemptionsAllowNeighborDiscovery\":  false,\r\n    \"firewallIPSecExemptionsAllowICMP\":  false,\r\n    \"firewallIPSecExemptionsAllowRouterDiscovery\":  false,\r\n    \"firewallIPSecExemptionsAllowDHCP\":  false,\r\n    \"firewallCertificateRevocationListCheckMethod\":  \"deviceDefault\",\r\n    \"firewallMergeKeyingModuleSettings\":  null,\r\n    \"firewallPacketQueueingMethod\":  \"deviceDefault\",\r\n    \"firewallProfileDomain\":  null,\r\n    \"firewallProfilePublic\":  null,\r\n    \"firewallProfilePrivate\":  null,\r\n    \"defenderAdobeReaderLaunchChildProcess\":  \"notConfigured\",\r\n    \"defenderAttackSurfaceReductionExcludedPaths\":  [\r\n\r\n                                                    ],\r\n    \"defenderOfficeAppsOtherProcessInjectionType\":  \"userDefined\",\r\n    \"defenderOfficeAppsOtherProcessInjection\":  \"userDefined\",\r\n    \"defenderOfficeCommunicationAppsLaunchChildProcess\":  \"notConfigured\",\r\n    \"defenderOfficeAppsExecutableContentCreationOrLaunchType\":  \"userDefined\",\r\n    \"defenderOfficeAppsExecutableContentCreationOrLaunch\":  \"userDefined\",\r\n    \"defenderOfficeAppsLaunchChildProcessType\":  \"userDefined\",\r\n    \"defenderOfficeAppsLaunchChildProcess\":  \"userDefined\",\r\n    \"defenderOfficeMacroCodeAllowWin32ImportsType\":  \"userDefined\",\r\n    \"defenderOfficeMacroCodeAllowWin32Imports\":  \"userDefined\",\r\n    \"defenderScriptObfuscatedMacroCodeType\":  \"userDefined\",\r\n    \"defenderScriptObfuscatedMacroCode\":  \"userDefined\",\r\n    \"defenderScriptDownloadedPayloadExecutionType\":  \"userDefined\",\r\n    \"defenderScriptDownloadedPayloadExecution\":  \"userDefined\",\r\n    \"defenderPreventCredentialStealingType\":  \"notConfigured\",\r\n    \"defenderProcessCreationType\":  \"userDefined\",\r\n    \"defenderProcessCreation\":  \"userDefined\",\r\n    \"defenderUntrustedUSBProcessType\":  \"userDefined\",\r\n    \"defenderUntrustedUSBProcess\":  \"userDefined\",\r\n    \"defenderUntrustedExecutableType\":  \"userDefined\",\r\n    \"defenderUntrustedExecutable\":  \"userDefined\",\r\n    \"defenderEmailContentExecutionType\":  \"userDefined\",\r\n    \"defenderEmailContentExecution\":  \"userDefined\",\r\n    \"defenderAdvancedRansomewareProtectionType\":  \"notConfigured\",\r\n    \"defenderGuardMyFoldersType\":  \"userDefined\",\r\n    \"defenderGuardedFoldersAllowedAppPaths\":  [\r\n\r\n                                              ],\r\n    \"defenderAdditionalGuardedFolders\":  [\r\n\r\n                                         ],\r\n    \"defenderNetworkProtectionType\":  \"notConfigured\",\r\n    \"defenderExploitProtectionXml\":  null,\r\n    \"defenderExploitProtectionXmlFileName\":  null,\r\n    \"defenderSecurityCenterBlockExploitProtectionOverride\":  false,\r\n    \"defenderBlockPersistenceThroughWmiType\":  \"userDefined\",\r\n    \"appLockerApplicationControl\":  \"notConfigured\",\r\n    \"deviceGuardLocalSystemAuthorityCredentialGuardSettings\":  \"notConfigured\",\r\n    \"deviceGuardEnableVirtualizationBasedSecurity\":  false,\r\n    \"deviceGuardEnableSecureBootWithDMA\":  false,\r\n    \"deviceGuardSecureBootWithDMA\":  \"notConfigured\",\r\n    \"deviceGuardLaunchSystemGuard\":  \"notConfigured\",\r\n    \"smartScreenEnableInShell\":  false,\r\n    \"smartScreenBlockOverrideForFiles\":  false,\r\n    \"applicationGuardEnabled\":  false,\r\n    \"applicationGuardEnabledOptions\":  \"notConfigured\",\r\n    \"applicationGuardBlockFileTransfer\":  \"notConfigured\",\r\n    \"applicationGuardBlockNonEnterpriseContent\":  false,\r\n    \"applicationGuardAllowPersistence\":  false,\r\n    \"applicationGuardForceAuditing\":  false,\r\n    \"applicationGuardBlockClipboardSharing\":  \"notConfigured\",\r\n    \"applicationGuardAllowPrintToPDF\":  false,\r\n    \"applicationGuardAllowPrintToXPS\":  false,\r\n    \"applicationGuardAllowPrintToLocalPrinters\":  false,\r\n    \"applicationGuardAllowPrintToNetworkPrinters\":  false,\r\n    \"applicationGuardAllowVirtualGPU\":  false,\r\n    \"applicationGuardAllowFileSaveOnHost\":  false,\r\n    \"applicationGuardAllowCameraMicrophoneRedirection\":  null,\r\n    \"applicationGuardCertificateThumbprints\":  [\r\n\r\n                                               ],\r\n    \"bitLockerAllowStandardUserEncryption\":  false,\r\n    \"bitLockerDisableWarningForOtherDiskEncryption\":  false,\r\n    \"bitLockerEnableStorageCardEncryptionOnMobile\":  false,\r\n    \"bitLockerEncryptDevice\":  false,\r\n    \"bitLockerRecoveryPasswordRotation\":  \"notConfigured\",\r\n    \"defenderDisableScanArchiveFiles\":  null,\r\n    \"defenderAllowScanArchiveFiles\":  null,\r\n    \"defenderDisableBehaviorMonitoring\":  null,\r\n    \"defenderAllowBehaviorMonitoring\":  null,\r\n    \"defenderDisableCloudProtection\":  null,\r\n    \"defenderAllowCloudProtection\":  null,\r\n    \"defenderEnableScanIncomingMail\":  null,\r\n    \"defenderEnableScanMappedNetworkDrivesDuringFullScan\":  null,\r\n    \"defenderDisableScanRemovableDrivesDuringFullScan\":  null,\r\n    \"defenderAllowScanRemovableDrivesDuringFullScan\":  null,\r\n    \"defenderDisableScanDownloads\":  null,\r\n    \"defenderAllowScanDownloads\":  null,\r\n    \"defenderDisableIntrusionPreventionSystem\":  null,\r\n    \"defenderAllowIntrusionPreventionSystem\":  null,\r\n    \"defenderDisableOnAccessProtection\":  null,\r\n    \"defenderAllowOnAccessProtection\":  null,\r\n    \"defenderDisableRealTimeMonitoring\":  null,\r\n    \"defenderAllowRealTimeMonitoring\":  null,\r\n    \"defenderDisableScanNetworkFiles\":  null,\r\n    \"defenderAllowScanNetworkFiles\":  null,\r\n    \"defenderDisableScanScriptsLoadedInInternetExplorer\":  null,\r\n    \"defenderAllowScanScriptsLoadedInInternetExplorer\":  null,\r\n    \"defenderBlockEndUserAccess\":  null,\r\n    \"defenderAllowEndUserAccess\":  null,\r\n    \"defenderScanMaxCpuPercentage\":  null,\r\n    \"defenderCheckForSignaturesBeforeRunningScan\":  null,\r\n    \"defenderCloudBlockLevel\":  null,\r\n    \"defenderCloudExtendedTimeoutInSeconds\":  null,\r\n    \"defenderDaysBeforeDeletingQuarantinedMalware\":  null,\r\n    \"defenderDisableCatchupFullScan\":  null,\r\n    \"defenderDisableCatchupQuickScan\":  null,\r\n    \"defenderEnableLowCpuPriority\":  null,\r\n    \"defenderFileExtensionsToExclude\":  [\r\n\r\n                                        ],\r\n    \"defenderFilesAndFoldersToExclude\":  [\r\n\r\n                                         ],\r\n    \"defenderProcessesToExclude\":  [\r\n\r\n                                   ],\r\n    \"defenderPotentiallyUnwantedAppAction\":  null,\r\n    \"defenderScanDirection\":  null,\r\n    \"defenderScanType\":  null,\r\n    \"defenderScheduledQuickScanTime\":  null,\r\n    \"defenderScheduledScanDay\":  null,\r\n    \"defenderScheduledScanTime\":  null,\r\n    \"defenderSignatureUpdateIntervalInHours\":  null,\r\n    \"defenderSubmitSamplesConsentType\":  null,\r\n    \"defenderDetectedMalwareActions\":  null,\r\n    \"firewallRules\":  [\r\n                          {\r\n                              \"displayName\":  \"WUDFHost\",\r\n                              \"description\":  \"Allow Miracast\",\r\n                              \"packageFamilyName\":  null,\r\n                              \"filePath\":  \"%systemroot%\\\\system32\\\\WUDFHost.exe\",\r\n                              \"serviceName\":  null,\r\n                              \"protocol\":  6,\r\n                              \"localPortRanges\":  [\r\n\r\n                                                  ],\r\n                              \"remotePortRanges\":  [\r\n\r\n                                                   ],\r\n                              \"localAddressRanges\":  [\r\n\r\n                                                     ],\r\n                              \"remoteAddressRanges\":  [\r\n\r\n                                                      ],\r\n                              \"profileTypes\":  \"domain,private,public\",\r\n                              \"action\":  \"allowed\",\r\n                              \"trafficDirection\":  \"in\",\r\n                              \"interfaceTypes\":  \"remoteAccess,wireless,lan\",\r\n                              \"edgeTraversal\":  \"notConfigured\",\r\n                              \"localUserAuthorizations\":  null\r\n                          }\r\n                      ],\r\n    \"bitLockerSystemDrivePolicy\":  {\r\n                                       \"encryptionMethod\":  null,\r\n                                       \"startupAuthenticationRequired\":  false,\r\n                                       \"startupAuthenticationBlockWithoutTpmChip\":  false,\r\n                                       \"startupAuthenticationTpmUsage\":  \"blocked\",\r\n                                       \"startupAuthenticationTpmPinUsage\":  \"blocked\",\r\n                                       \"startupAuthenticationTpmKeyUsage\":  \"blocked\",\r\n                                       \"startupAuthenticationTpmPinAndKeyUsage\":  \"blocked\",\r\n                                       \"minimumPinLength\":  null,\r\n                                       \"recoveryOptions\":  null,\r\n                                       \"prebootRecoveryEnableMessageAndUrl\":  false,\r\n                                       \"prebootRecoveryMessage\":  null,\r\n                                       \"prebootRecoveryUrl\":  null\r\n                                   },\r\n    \"bitLockerFixedDrivePolicy\":  {\r\n                                      \"encryptionMethod\":  null,\r\n                                      \"requireEncryptionForWriteAccess\":  false,\r\n                                      \"recoveryOptions\":  null\r\n                                  },\r\n    \"bitLockerRemovableDrivePolicy\":  {\r\n                                          \"encryptionMethod\":  null,\r\n                                          \"requireEncryptionForWriteAccess\":  false,\r\n                                          \"blockCrossOrganizationWriteAccess\":  false\r\n                                      }\r\n}",
                  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations",
                  "YSP_V1_Windows_Allow_Miracast_Custom",
                  [
                      "dc4dffdd-e0da-42e5-84c3-a0a223e60bcb"
                  ],
                  {

                  }
              ],
    "Count":  5
}